src/explanations/whats-a-monad.org
#+OPTIONS: toc:nil
#+TITLE: What's a monad?
#+author: Jason DeLaat
#+email: jason.develops@gmail.com

Note: The following explanation is based on [[https://bartoszmilewski.com/2016/11/21/monads-programmers-definition/][this post]] by Bartosz
Milewski.

* Introduction
Monads are famously misunderstood. They've been likened to space
suits, toxic waste and who knows what else. Depending on who you ask
you might be told that monads are about:

- Order of evaluation :: Since languages that provide monads by default
     tend to be pure functional and declarative, we don't usually know
     the exact order of evaluation. Whatever else they may do, the
     main thing we use monads for, the story goes, is to enforce a
     particular order of evaluation in places where that is important.
- Side effects and IO :: Pure functional languages ban side effects so handling
     things like mutable state, errors and IO don't work the way most
     of us are used to. Monads allow us to do side effect-like things
     in a pure functional context.

Monads are used for these things but that's not really what they /are/
or what they're /about/ and focusing too much on those aspects tends
to confuse the situation. What monads actually are is deceptively
simple: monads are function composition.

* A simple logging example
  At least as far as programmers need to worry about them, monads are
  basically just a type of function composition. If you understand
  how function composition works, you pretty much understand monads.
  
  So let's see how this works. For the purposes of explanation we need
  a way to compose functions. Pymonad has a [[file:/usr/home/jason/Files/Python/pymonad_docs/src/how-to/function-composition.org][Compose construct]] for this
  purpose but it's built on top of the Reader monad and I don't want
  to use a monad to explain monads. So we'll use this instead:
  
  #+begin_src python
    def compose(f, g):
	return lambda x: g(f(x))
  #+end_src
  
  Many languages that have a composition operator compose functions
  right-to-left but for a named composition function I prefer the
  semantics of composing left-to-right, so the above function
  evaluates =f= first and then feeds the result to =g=. 
  
  Alright, so suppose we're writing some program and we have these two
  functions:

  #+begin_src python
    def add_7(x):
	return x + 7

    def mul_5(x):
	return x * 5
  #+end_src
  
  And somewhere in our program we commpose those two functions like
  so:

  #+begin_src python
    composed_arithmetic = compose(add_7, mul_5)
    # ... more code ...
    some_var = composed_arithmetic(6) # result: 65
  #+end_src
  
  So far so good. The problem comes when we decide it would be great
  if our functions created a log. We don't want to mutate global state
  and it's not really the job of our functions to know anything about
  the /entire/ log so we just have our functions return a string along
  with the result that we were returning before.
  
  #+begin_src python
    def add_7(x):
	return x + 7, 'Adding 7 to input {}\n'.format(x)

    def mul_5(x):
	return x * 5, 'Multiplying input {} by 5\n'.format(x)
  #+end_src

  But as soon as we do that, we've broken =composed_arithmetic=.
  =add_7= is returning a tuple but =mul_5= is expecting just a
  number. Importantly: We still want to be able to compose these
  functions like we did before; the overall behaviour of the system
  should be the same just with added logging; we need to do it in a
  way that deals with the logging information. So what do we do? We
  change how composition works!
  
  #+begin_src python
    def compose_with_logging(f, g):
	def _compose_internal(x):
	    fx, f_log = f(x)
	    gx, g_log = g(fx)
	    return gx, f_log + g_log
	return _compose_internal
  #+end_src
  
  And then we update the composition:

  #+begin_src python
    composed_arithmetic = compose_with_logging(add_7, mul_5)
    # ... more code ...
    
    # This doesn't change!
    some_var = composed_arithmetic(6) # result: 65, "Adding 7 to input 6
                                      #              Multiplying input 13 by 5"
  #+end_src
  
  Now you can add logging to any functions you want and if you were
  composing those functions all you need to do is switch to using
  =compose_with_logging= and everything will work as expected. 

  If we must use metaphores when talking about monads then we should
  at least use one that's relevant to programming. The functions above
  return a value that we're actually interested in and some additional
  metadata. In this case the metadata is logging information, in other
  cases it might be error states, mutable state, or something
  else. But in all cases adding metadata to the return types of our
  functions breaks composition forcing us to /redefine/ composition in a
  way that takes the metadata into account.

  That's a monad.

