explanations/whats-a-monad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-17 Mon 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What's a monad?</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jason DeLaat" />
<link rel='stylesheet' type='text/css' href='./css/org.css' /><link rel='stylesheet' type='text/css' href='../css/org.css' />
</head>
<body>
<div id="content">
<h1 class="title">What's a monad?</h1>
<p>
Note: The following explanation is based on <a href="https://bartoszmilewski.com/2016/11/21/monads-programmers-definition/">this post</a> by Bartosz
Milewski.
</p>

<div id="outline-container-org3e94c30" class="outline-2">
<h2 id="org3e94c30">Introduction</h2>
<div class="outline-text-2" id="text-org3e94c30">
<p>
Monads are famously misunderstood. They've been likened to space
suits, toxic waste and who knows what else. Depending on who you ask
you might be told that monads are about:
</p>

<dl class="org-dl">
<dt>Order of evaluation</dt><dd>Since languages that provide monads by default
tend to be pure functional and declarative, we don't usually know
the exact order of evaluation. Whatever else they may do, the
main thing we use monads for, the story goes, is to enforce a
particular order of evaluation in places where that is important.</dd>
<dt>Side effects and IO</dt><dd>Pure functional languages ban side effects so handling
things like mutable state, errors and IO don't work the way most
of us are used to. Monads allow us to do side effect-like things
in a pure functional context.</dd>
</dl>

<p>
Monads are used for these things but that's not really what they <i>are</i>
or what they're <i>about</i> and focusing too much on those aspects tends
to confuse the situation. What monads actually are is deceptively
simple: monads are function composition.
</p>
</div>
</div>

<div id="outline-container-orgd100ddf" class="outline-2">
<h2 id="orgd100ddf">A simple logging example</h2>
<div class="outline-text-2" id="text-orgd100ddf">
<p>
At least as far as programmers need to worry about them, monads are
basically just a type of function composition. If you understand
how function composition works, you pretty much understand monads.
</p>

<p>
So let's see how this works. For the purposes of explanation we need
a way to compose functions. Pymonad has a <a href="how-to/function-composition.html">Compose construct</a> for this
purpose but it's built on top of the Reader monad and I don't want
to use a monad to explain monads. So we'll use this instead:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">compose</span>(f, g):
    <span style="color: #859900;">return</span> <span style="color: #859900;">lambda</span> x: g(f(x))
</pre>
</div>

<p>
Many languages that have a composition operator compose functions
right-to-left but for a named composition function I prefer the
semantics of composing left-to-right, so the above function
evaluates <code>f</code> first and then feeds the result to <code>g</code>. 
</p>

<p>
Alright, so suppose we're writing some program and we have these two
functions:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">add_7</span>(x):
    <span style="color: #859900;">return</span> x + 7

<span style="color: #859900;">def</span> <span style="color: #b58900;">mul_5</span>(x):
    <span style="color: #859900;">return</span> x * 5
</pre>
</div>

<p>
And somewhere in our program we commpose those two functions like
so:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">composed_arithmetic</span> = compose(add_7, mul_5)
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">... more code ...</span>
<span style="color: #6c71c4;">some_var</span> = composed_arithmetic(6) <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">result: 65</span>
</pre>
</div>

<p>
So far so good. The problem comes when we decide it would be great
if our functions created a log. We don't want to mutate global state
and it's not really the job of our functions to know anything about
the <i>entire</i> log so we just have our functions return a string along
with the result that we were returning before.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">add_7</span>(x):
    <span style="color: #859900;">return</span> x + 7, <span style="color: #2aa198;">'Adding 7 to input {}\n'</span>.<span style="color: #6c71c4;">format</span>(x)

<span style="color: #859900;">def</span> <span style="color: #b58900;">mul_5</span>(x):
    <span style="color: #859900;">return</span> x * 5, <span style="color: #2aa198;">'Multiplying input {} by 5\n'</span>.<span style="color: #6c71c4;">format</span>(x)
</pre>
</div>

<p>
But as soon as we do that, we've broken <code>composed_arithmetic</code>.
<code>add_7</code> is returning a tuple but <code>mul_5</code> is expecting just a
number. Importantly: We still want to be able to compose these
functions like we did before; the overall behaviour of the system
should be the same just with added logging; we need to do it in a
way that deals with the logging information. So what do we do? We
change how composition works!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">compose_with_logging</span>(f, g):
    <span style="color: #859900;">def</span> <span style="color: #b58900;">_compose_internal</span>(x):
        <span style="color: #6c71c4;">fx</span>, <span style="color: #6c71c4;">f_log</span> = f(x)
        <span style="color: #6c71c4;">gx</span>, <span style="color: #6c71c4;">g_log</span> = g(fx)
        <span style="color: #859900;">return</span> gx, f_log + g_log
    <span style="color: #859900;">return</span> _compose_internal
</pre>
</div>

<p>
And then we update the composition:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">composed_arithmetic</span> = compose_with_logging(add_7, mul_5)
<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">... more code ...</span>

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">This doesn't change!</span>
<span style="color: #6c71c4;">some_var</span> = composed_arithmetic(6) <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">result: 65, "Adding 7 to input 6</span>
                                  <span style="color: #93a1a1; font-style: italic;">#              </span><span style="color: #93a1a1; font-style: italic;">Multiplying input 13 by 5"</span>
</pre>
</div>

<p>
Now you can add logging to any functions you want and if you were
composing those functions all you need to do is switch to using
<code>compose_with_logging</code> and everything will work as expected. 
</p>

<p>
If we must use metaphores when talking about monads then we should
at least use one that's relevant to programming. The functions above
return a value that we're actually interested in and some additional
metadata. In this case the metadata is logging information, in other
cases it might be error states, mutable state, or something
else. But in all cases adding metadata to the return types of our
functions breaks composition forcing us to <i>redefine</i> composition in a
way that takes the metadata into account.
</p>

<p>
That's a monad.
</p>
</div>
</div>
