src/explanations/whats-a-monad.org
* All monad types are tuples in disguise
  The above example is a simplified version of the Writer monad. In a
  sense, the monad's type is the tuple returned from each of the
  functions: (int, string). 

  It turns out that /all/ monads can actually be expressed in the
  general form (a, m), where /a/ is the return value that you're
  interested in and /m/ is the 'metadata' which the monad deals
  with. If you've played around with monads before though you'll know
  that they don't always look like tuples. So what's going on?
  
  The answer has to do with algebraic data types and how they can be
  manipulated into equivalent forms. That's beyond the scope of this
  article, but a quick example should give you a general idea. 

  Let's look at simple error handling. Our metadata will be booleans:
  True indicates that the returned value is valid and can be used in
  further computations; False indicates the value is invalid and
  should be ignored.

  #+begin_src python
    def add_7(x):
	# Errors won't happen in this function so we can always return a
	# valid result.
	return (x + 7, True)

    def not_zero(x):
	if x == 0:
	    # It's an error if we get the value zero
	    return (None, False)
	else:
	    # But any other number is OK, we just pass it on.
	    return (x, True)

    def compose_with_errors(f, g):
	def _compose_internal(x):
	    fx, f_err = f(x)
	    gx, g_err = g(fx)
	    return (gx, f_err and g_err)
	return _compose_internal
  #+end_src
  
  This works much like the logging example but instead of
  concatenating logs we use a logical =and= to combine error
  states. If either input function fails then the whole thing
  fails.
  
  But having to construct tuples all the time is error prone and has
  little semantic value. Instead we can implement functions to do it
  for us.

  #+begin_src python
    def Result(x):
	return (x, True)

    Error = (None, False)
  #+end_src
  
  Since the semantics of errors is that we ignore the returned value,
  one =Error= is just as good as any other and the value doesn't
  matter. That's why we don't need an =Error= function but can just
  use a constant. Now we can write our functions like so:

  #+begin_src python
    def add_7(x):
	# Errors won't happen in this function so we can always return a
	# valid result.
	return Result(x + 7)

    def not_zero(x):
	if x == 0:
	    # It's an error if we get the value zero
	    return Error
	else:
	    # But any other number is OK, we just pass it on.
	    return Result(x)
  #+end_src
  
  The =compose_with_errors= function still works exactly the same
  way. So even though in this version the monad values don't /look/
  like tuples, they really are in the background. The translation to
  and from a tuple representation isn't always this straight-forward
  but it is always possible.

