explanations/whats-a-monad.html

<div id="outline-container-org2be593b" class="outline-2">
<h2 id="org2be593b">All monad types are tuples in disguise</h2>
<div class="outline-text-2" id="text-org2be593b">
<p>
The above example is a simplified version of the Writer monad. In a
sense, the monad's type is the tuple returned from each of the
functions: (int, string). 
</p>

<p>
It turns out that <i>all</i> monads can actually be expressed in the
general form (a, m), where <i>a</i> is the return value that you're
interested in and <i>m</i> is the 'metadata' which the monad deals
with. If you've played around with monads before though you'll know
that they don't always look like tuples. So what's going on?
</p>

<p>
The answer has to do with algebraic data types and how they can be
manipulated into equivalent forms. That's beyond the scope of this
article, but a quick example should give you a general idea. 
</p>

<p>
Let's look at simple error handling. Our metadata will be booleans:
True indicates that the returned value is valid and can be used in
further computations; False indicates the value is invalid and
should be ignored.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">add_7</span>(x):
    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Errors won't happen in this function so we can always return a</span>
    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">valid result.</span>
    <span style="color: #859900;">return</span> (x + 7, <span style="color: #268bd2;">True</span>)

<span style="color: #859900;">def</span> <span style="color: #b58900;">not_zero</span>(x):
    <span style="color: #859900;">if</span> x == 0:
        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">It's an error if we get the value zero</span>
        <span style="color: #859900;">return</span> (<span style="color: #268bd2;">None</span>, <span style="color: #268bd2;">False</span>)
    <span style="color: #859900;">else</span>:
        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">But any other number is OK, we just pass it on.</span>
        <span style="color: #859900;">return</span> (x, <span style="color: #268bd2;">True</span>)

<span style="color: #859900;">def</span> <span style="color: #b58900;">compose_with_errors</span>(f, g):
    <span style="color: #859900;">def</span> <span style="color: #b58900;">_compose_internal</span>(x):
        <span style="color: #6c71c4;">fx</span>, <span style="color: #6c71c4;">f_err</span> = f(x)
        <span style="color: #6c71c4;">gx</span>, <span style="color: #6c71c4;">g_err</span> = g(fx)
        <span style="color: #859900;">return</span> (gx, f_err <span style="color: #859900;">and</span> g_err)
    <span style="color: #859900;">return</span> _compose_internal
</pre>
</div>

<p>
This works much like the logging example but instead of
concatenating logs we use a logical <code>and</code> to combine error
states. If either input function fails then the whole thing
fails.
</p>

<p>
But having to construct tuples all the time is error prone and has
little semantic value. Instead we can implement functions to do it
for us.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">Result</span>(x):
    <span style="color: #859900;">return</span> (x, <span style="color: #268bd2;">True</span>)

<span style="color: #6c71c4;">Error</span> = (<span style="color: #268bd2;">None</span>, <span style="color: #268bd2;">False</span>)
</pre>
</div>

<p>
Since the semantics of errors is that we ignore the returned value,
one <code>Error</code> is just as good as any other and the value doesn't
matter. That's why we don't need an <code>Error</code> function but can just
use a constant. Now we can write our functions like so:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">add_7</span>(x):
    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Errors won't happen in this function so we can always return a</span>
    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">valid result.</span>
    <span style="color: #859900;">return</span> Result(x + 7)

<span style="color: #859900;">def</span> <span style="color: #b58900;">not_zero</span>(x):
    <span style="color: #859900;">if</span> x == 0:
        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">It's an error if we get the value zero</span>
        <span style="color: #859900;">return</span> Error
    <span style="color: #859900;">else</span>:
        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">But any other number is OK, we just pass it on.</span>
        <span style="color: #859900;">return</span> Result(x)
</pre>
</div>

<p>
The <code>compose_with_errors</code> function still works exactly the same
way. So even though in this version the monad values don't <i>look</i>
like tuples, they really are in the background. The translation to
and from a tuple representation isn't always this straight-forward
but it is always possible.
</p>
</div>
</div>
