src/explanations/whats-a-monad.org
* Generalizing
   If you know a little bit about monads already you might be
   wondering where =bind= (the =>>== operator in Haskell) is in all of
   this. It's actually hiding in plain sight.
   
   When we wrote the logging example we had to write a
   =compose_with_logging= function. When we wrote the error example we
   needed a =compose_with_errors= function. And any other monads we
   wanted to implement would require their own =compose_with_*=
   function as well.

   If we change =add_7= and =mul_5= to error tracking functions we
   also have to change =composed_arithmetic= to call the correct
   compose function. That's kind of a pain. It would be nice if we
   could change which /type/ of composition we're doing without having
   to change every call to a composition function.
   
   Let's go back to logging for a moment. Instead of having the
   functions return a tuple, let's have them return a =Logging=
   object.

   #+begin_src python
     class Logging:
	 def __init__(self, result, message):
	     self.result = result
	     self.message = message

     def add_7(x):
	 return Logging(x + 7, 'Adding 7 to input {}\n'.format(x))

     def mul_5(x):
	 return Logging(x * 5, 'Multiplying input {} by 5\n'.format(x))

     def monad_compose(f, g):
	 # How do we define this?
	 pass

     composed_arithmetic = monad_compose(add_7, mull_5)
     some_var = composed_arithmetic(6)
   #+end_src
   
   How do we define composition for functions of this type? The
   resulting function has to take an integer as input and should return
   a =Logging= object as output. The input needs to be passed to the
   first function:

   #+begin_src python
     def monad_compose(f, g):
	 return lambda x: f(x) #...then what?
   #+end_src

   Next we need access to the result and message returned by =f= so we
   can apply it to =g=. Since we need access to the internals of a
   =Logging= object let's make it a method:

   #+begin_src python
     class Logging:
	 def __init__(self, result, message):
	     self.result = result
	     self.message = message

	 def bind(self, g):
	     # The infamous bind
	     gx, g_log = g(self.result)
	     return Logging(gx, self.message + g_log)

     def monad_compose(f, g):
	 return lambda x: f(x).bind(g)
   #+end_src
   
   Now we've encapsulated the logic of dealing with logs into the
   logging object itself and made =monad_compose=[fn::In pymonad.tools
   this function is called =kleisli_compose=.] entirely general. If we
   want to change the functions to deal with errors we can create an
   Error class with it's own =bind= method to handle things correctly
   and =monad_compose= will continue to work properly.

   Many explanation of monads start by trying to explain =bind= and
   that's where a lot of confusion creeps in. It has a strange type
   signature and it's hard to explain exactly what =bind= does since
   it does something different for every single monad. But actually,
   it's not so mysterious: =bind= exists as a consequence of
   generalizing =monad_compose= and it's simply where we encapsulate
   the composition logic for the type.

   The reason so many explanations of monads start by trying to
   explain =bind= is because once you have =bind= it's often
   convenient to just use it directly instead of bothering with
   =monad_compose=.
   
   Once we've got that =Logging= class we can do something like this:

   #+begin_src python
     some_var = (
	 Logging(6, '')
	 .bind(add_7)
	 .bind(mul_5)
     )
   #+end_src

   =monad_compose= creates a new function that you can use repeatedly
   but even that can be done with bind:

   #+begin_src python
     composed_arithmetic = lambda x: Logging(x, '').bind(add_7).bind(mul_5)

     # Or
     def composed_arithmetic(x):
	 return (
	     Logging(x, '')
	     .bind(add_7)
	     .bind(mul_5)
	 )
   #+end_src

   So =bind= is generally more useful than =monad_compose= but
   =monad_compose= makes it clearer what the purpose of a monad
   actually is: function composition.
