explanations/whats-a-monad.html

<div id="outline-container-orgdb63a15" class="outline-2">
<h2 id="orgdb63a15">Generalizing</h2>
<div class="outline-text-2" id="text-orgdb63a15">
<p>
If you know a little bit about monads already you might be
wondering where <code>bind</code> (the <code>&gt;&gt;=</code> operator in Haskell) is in all of
this. It's actually hiding in plain sight.
</p>

<p>
When we wrote the logging example we had to write a
<code>compose_with_logging</code> function. When we wrote the error example we
needed a <code>compose_with_errors</code> function. And any other monads we
wanted to implement would require their own <code>compose_with_*</code>
function as well.
</p>

<p>
If we change <code>add_7</code> and <code>mul_5</code> to error tracking functions we
also have to change <code>composed_arithmetic</code> to call the correct
compose function. That's kind of a pain. It would be nice if we
could change which <i>type</i> of composition we're doing without having
to change every call to a composition function.
</p>

<p>
Let's go back to logging for a moment. Instead of having the
functions return a tuple, let's have them return a <code>Logging</code>
object.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #268bd2;">Logging</span>:
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span>(<span style="color: #859900;">self</span>, result, message):
        <span style="color: #859900;">self</span>.result = result
        <span style="color: #859900;">self</span>.message = message

<span style="color: #859900;">def</span> <span style="color: #b58900;">add_7</span>(x):
    <span style="color: #859900;">return</span> Logging(x + 7, <span style="color: #2aa198;">'Adding 7 to input {}\n'</span>.<span style="color: #6c71c4;">format</span>(x))

<span style="color: #859900;">def</span> <span style="color: #b58900;">mul_5</span>(x):
    <span style="color: #859900;">return</span> Logging(x * 5, <span style="color: #2aa198;">'Multiplying input {} by 5\n'</span>.<span style="color: #6c71c4;">format</span>(x))

<span style="color: #859900;">def</span> <span style="color: #b58900;">monad_compose</span>(f, g):
    <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">How do we define this?</span>
    <span style="color: #859900;">pass</span>

<span style="color: #6c71c4;">composed_arithmetic</span> = monad_compose(add_7, mull_5)
<span style="color: #6c71c4;">some_var</span> = composed_arithmetic(6)
</pre>
</div>

<p>
How do we define composition for functions of this type? The
resulting function has to take an integer as input and should return
a <code>Logging</code> object as output. The input needs to be passed to the
first function:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">monad_compose</span>(f, g):
    <span style="color: #859900;">return</span> <span style="color: #859900;">lambda</span> x: f(x) <span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">...then what?</span>
</pre>
</div>

<p>
Next we need access to the result and message returned by <code>f</code> so we
can apply it to <code>g</code>. Since we need access to the internals of a
<code>Logging</code> object let's make it a method:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #268bd2;">Logging</span>:
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span>(<span style="color: #859900;">self</span>, result, message):
        <span style="color: #859900;">self</span>.result = result
        <span style="color: #859900;">self</span>.message = message

    <span style="color: #859900;">def</span> <span style="color: #b58900;">bind</span>(<span style="color: #859900;">self</span>, g):
        <span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">The infamous bind</span>
        <span style="color: #6c71c4;">gx</span>, <span style="color: #6c71c4;">g_log</span> = g(<span style="color: #859900;">self</span>.result)
        <span style="color: #859900;">return</span> Logging(gx, <span style="color: #859900;">self</span>.message + g_log)

<span style="color: #859900;">def</span> <span style="color: #b58900;">monad_compose</span>(f, g):
    <span style="color: #859900;">return</span> <span style="color: #859900;">lambda</span> x: f(x).bind(g)
</pre>
</div>

<p>
Now we've encapsulated the logic of dealing with logs into the
logging object itself and made <code>monad_compose</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> entirely general. If we
want to change the functions to deal with errors we can create an
Error class with it's own <code>bind</code> method to handle things correctly
and <code>monad_compose</code> will continue to work properly.
</p>

<p>
Many explanation of monads start by trying to explain <code>bind</code> and
that's where a lot of confusion creeps in. It has a strange type
signature and it's hard to explain exactly what <code>bind</code> does since
it does something different for every single monad. But actually,
it's not so mysterious: <code>bind</code> exists as a consequence of
generalizing <code>monad_compose</code> and it's simply where we encapsulate
the composition logic for the type.
</p>

<p>
The reason so many explanations of monads start by trying to
explain <code>bind</code> is because once you have <code>bind</code> it's often
convenient to just use it directly instead of bothering with
<code>monad_compose</code>.
</p>

<p>
Once we've got that <code>Logging</code> class we can do something like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">some_var</span> = (
    Logging(6, <span style="color: #2aa198;">''</span>)
    .bind(add_7)
    .bind(mul_5)
)
</pre>
</div>

<p>
<code>monad_compose</code> creates a new function that you can use repeatedly
but even that can be done with bind:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">composed_arithmetic</span> = <span style="color: #859900;">lambda</span> x: Logging(x, <span style="color: #2aa198;">''</span>).bind(add_7).bind(mul_5)

<span style="color: #93a1a1; font-style: italic;"># </span><span style="color: #93a1a1; font-style: italic;">Or</span>
<span style="color: #859900;">def</span> <span style="color: #b58900;">composed_arithmetic</span>(x):
    <span style="color: #859900;">return</span> (
        Logging(x, <span style="color: #2aa198;">''</span>)
        .bind(add_7)
        .bind(mul_5)
    )
</pre>
</div>

<p>
So <code>bind</code> is generally more useful than <code>monad_compose</code> but
<code>monad_compose</code> makes it clearer what the purpose of a monad
actually is: function composition.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">In pymonad.tools
this function is called <code>kleisli_compose</code>.</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jason DeLaat</p>
<p class="date">Created: 2020-08-17 Mon 11:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
